[
  {
    "postID": 7,
    "postTitle": "What's new for 2025/26 for CodeSoc?",
    "postDescription": "This year's a big one. Tune in to see what we're cooking up!",
    "postCreationDate": "2025-09-14",
    "postTags": "ai",
    "postContent": "<h3>What are we THINKING?</h3><p>So, this year we're going absolutely mental with what we've got planned. And by mental, we mean the good kind - the kind that involves pizza, code, and probably some questionable life choices in the name of learning. We're promising to triple your counter for lifetime all-nighters ;)</p><h3>High Performance Computing (HPC) - Term 1</h3><p>We're diving headfirst into the world of supercomputers and parallel processing! First up, we're getting involved in the <b>CIUK25 Student Cluster Challenges</b> - basically the Olympics of making computers go very, very fast. Think your laptop runs slow? Wait until you're trying to optimize code across hundreds of cores.</p><p>But here's where it gets interesting: we might just buy a bunch of Raspberry Pis (in the name of... training?) and let you loose building your own actual cluster. Yes, you read that right. Real hardware, real networking, real chance of accidentally creating skynet (probably not, but we can dream).</p><h3>Rust & C++ - Term 2</h3><p>Term 2 is where we get our hands properly dirty with some systems programming. We're running:</p><ul><li><b>Rust Basics</b> - for those brave enough to fight the borrow checker</li><li><b>Advanced Rust Topics</b> - for those who've already been scarred by the borrow checker and want more</li><li><b>C++ Speedrun</b> - learn C++ fast, break things faster</li><li><b>Advanced C++ Topics</b> - hated Java-style reflection? We've got something somehow even worse.</li></ul><h3>Pizza, Pubs, and Partners</h3><p>Obviously, we're keeping the pizza tradition alive and well. Company events? Pizza. Course sessions? Pizza. Tuesday? Probably pizza. We take our carbs seriously around here.</p><p>We're also planning some casual pub trips, as well as some exciting collaborations in the works (company sponsors!), plus we're helping build this year's <b>Warwick Hackathon</b>. More details coming soon, but let's just say it's going to be pretty epic.</p><h3>Join the Chaos</h3><p>Whether you're a first-year who's never touched code or a PhD student who dreams in x86 ASM, there's something here for everyone. Come for the learning, stay for the pizza, leave with skills that'll make your CV look absolutely stunning.</p><p>Ready to dive in? Join our <a href='https://discord.gg/NDCg2VwQxZ'>Discord</a> and follow us on Instagram <a href='https://instagram.com/wwcodesoc'>@wwcodesoc</a> - that's where we'll mention stuff first!</p>",
    "postAuthor": "Alex Do",
    "postImageURL": "25-26-codesoc.jpg"
  },
  {
    "postID": 5,
    "postTitle": "Github Copilot, the future of programming?",
    "postDescription": "What will programming look like in the future? Github Copilot may allow us to better understand this.",
    "postTags": "AI",
    "postCreationDate": "2022-08-27",
    "postContent": "<h3>What is it?</h3><p>Github copilot is a collaboration between Github and OpenAI that prompts code recommendations to its users based on the context of the file being edited. It is trained using the publicly available repositories on the Github platform consisting of almost a billion lines of code.</p><quote>\"OpenAI is a private technology firm focused on artificial intelligence although its original mission was to build safe artificial intelligence. It was founded in December 2015, by SpaceX co-founder and Tesla CEO Elon Musk, Greg Brockman from notable data startup Cloudera, entrepreneur Rebekah Mercer, and entrepreneur Jack Hughes.\"</quote><img class='type1' src='/static/assets/blogPictures/copilotImage1.png' alt='Image of Github Copilot'><p>The paragraph that you see above was generated using OpenAI's GPT-3 software. The GPT-3 is a third generation of Generative Pre-Trained Transformer, capable of generating sequences of text. It is a trained language prediction model, that can output appropriate results based on an input text. </p><h3>Functionalities</h3><img class='type2' src='/static/assets/blogPictures/copilotImage2.png' alt='Functionalities of Github Copilot'><p>Github Copilot is powered by OpenAI codex, an AI system that is more capable than GPT-3 in code predictions. It is not limited to a single language framework which means that it has a wider use case, that works well for Python, JavaScript, TypeScript, Ruby and Go.</p><p>As all great products in the tech world, Github Co-Pilot is not a free product. They offer a 60 day free trial, but after that it will cost you 10$ per month, or you can pay it annually for 100$. However, students can get co-pilot for free thanks to the Github Global Campus program. If you're interested, go to this <a href='https://docs.github.com/en/education/explore-the-benefits-of-teaching-and-learning-with-github-education/github-global-campus-for-students/apply-to-github-global-campus-as-a-student'>link</a> and follow the steps</p><h3>Future of coding</h3><p>With the launch of a software that is capable of generating blocks of code or even functions with up to 10 different suggestions, has worried some web developers. While others believe that this revolution in coding could lead to efficient systems based on reviewing rather than manually writing code.</p><p>What do you think about Github Co-Pilot, where do you think the future of programming is headed? Come chat with us about it on our <a href='https://discord.com/invite/NDCg2VwQxZ'>discord server!</a></p>",
    "postAuthor": "Adriano Barbet & Akaesha Kohli",
    "postImageURL": "githubCopilot.png"
  },
  {
    "postID": 6,
    "postTitle": "Cloud Computing and how you can get started",
    "postDescription": "Check out some of the best resources in Cloud Computing, made available by some of the biggest companies in tech.",
    "postTags": "Cloud",
    "postCreationDate": "2022-08-29",
    "postContent": "<h3>What is it?</h3><p>Big tech companies like Amazon, Microsoft and Google \"rent out\" their vast availability of computing power and data storage for people and businesses to use over the internet. For example, companies such as Netflix, Twitter, LinkedIn and the BBC all make use of Amazon Web Services (AWS) to host and serve their content. In fact almost every major online business uses this technology, making it a billion-dollar industry.</p><p>So you might be asking things like 'Why do I want to learn about this?' and <a target='_blank' href='https://www.quora.com/Why-does-Amazon-Prime-Video-lag-compared-to-Netflix-since-both-are-on-AWS/answer/Yashvardhan-Mulki?ch=10&oid=106008513&share=2802ccd4&srid=ufcIdZ&target_type=answer'>\"Why does Netflix load faster than Prime Video when both are hosted on Amazon's servers?\"</a>. Well, cloud computing as a skill is becoming increasingly valuable as the global use of cloud services increases every year. Jobs in cloud services pay extremely well, and for those considering it as a career, it is very easy to get started just from your laptop.</p><h3>How do I get started?</h3><p>The great thing about computing is you don't usually need a job to gain experience. Every cloud computing company wants people to learn how to use their service, and most provide online courses and certifications which look great on a CV.</p><img class='type3' src='/static/assets/blogPictures/aws.png' alt='Amazon Web Services'><p><b>Amazon Web Services</b> is Amazon's cloud platform and is the biggest and most widely used in cloud computing today. Visit <a target='_blank' href='https://aws.amazon.com/education/awseducate/'>AWS Educate</a> to find beginner-tailored content such as interactive labs and courses. They have resources for 'learners as young as 13' and it's all free.</p><p>For those looking for something more advanced, they run online live classes which you can register for at <a target='_blank' href='https://www.aws.training/'>AWS training</a>. Lots of these are paid, but many are free. (Note that their certification exams are all paid).</p><img class='type3' src='/static/assets/blogPictures/azure.png' alt='Azure'><p>Microsoft's platform is <b>Azure</b> and while their services and certifications are usually paid, students can claim $100 of free credit, after using up all your credit you still get certain monthly amounts of services free for 12 months, and it also renews every year. Just check out <a target='_blank' href='https://azure.microsoft.com/it-it/free/students/'>azure.microsoft.com/free/students</a>.</p><p>As well as providing loads of <a target='_blank' href='https://docs.microsoft.com/it-it/learn/'>learning resources</a>, this is also great for those that just want to explore the Azure dashboard and create their own cloud applications. (If you run out of credits, just ask a fellow student with no interest in cloud computing and sign up with their details). Students can also claim <a target='_blank' href='https://docs.microsoft.com/en-us/certifications/student-training-and-certification'>free exam vouchers</a> which allow you to earn a certification for free.</p><img class='type3' src='/static/assets/blogPictures/googlecloud.png' alt='Google Cloud'><p><b>Google Cloud</b> is the smallest of these 3 in the cloud computing market, but still offers vast amounts of user-friendly resources. All of the course materials like videos and documents are free, whereas interactive labs require credits. Google also offers several trial programs which give you <a target='_blank' href='https://cloud.google.com/free/docs/free-cloud-features'>free access to Google Cloud.</a></p>",
    "postAuthor": "Kailo Bouskila",
    "postImageURL": "cloud.png"
  }
]
